---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextStyleItalic
source: html/fc203b47-2781-23a6-6643-f74659869c5f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextStyleItalic Property

"Italic"

## Syntax (C#)
```csharp
public static ForgeTypeId TextStyleItalic { get; }
```